{
  "backend/main.mo": "Main actor implementing a shop management system with income, expenses, sales, purchases, supplier loans, and advance payments tracking, including user profile management and access control with migration support.",
  "backend/migration.mo": "Migration module that adds supplierLoans and advancePayments maps to the existing actor state while preserving income, expense, sales, and purchase records.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: supplier loans tracking, advance payments tracking, navigation tabs for both sections, and dashboard summary statistics.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including forms, lists, pages, hooks, and utilities for managing income, expenses, sales, purchases, supplier loans, and advance payments.",
  "frontend/index.css": "Global Tailwind CSS styles with custom warm earth-tone color system using OKLCH for both light and dark modes, including sidebar and chart color variables.",
  "frontend/index.html": "HTML entry point for the Rida Shop Manager application with root div and module script reference.",
  "frontend/src/App.tsx": "Main React application component with Internet Identity authentication, tab-based navigation for seven sections (Dashboard, Income, Expenses, Sales, Purchases, Supplier Loans, Advance Payments), and header with sign-out functionality.",
  "frontend/src/components/AdvancePaymentForm.tsx": "Form component for adding advance payment records with amount, supplier name, and purpose fields, including validation and toast notifications on submission.",
  "frontend/src/components/AdvancePaymentList.tsx": "Displays a table of advance payments with sorting by date, status badges (Settled/Pending), and a button to mark pending payments as settled using mutation hooks.",
  "frontend/src/components/AdvancePaymentPage.tsx": "Page component that combines AdvancePaymentForm and AdvancePaymentList to provide a complete interface for managing advance payments to suppliers.",
  "frontend/src/components/Dashboard.tsx": "Dashboard overview displaying today's summary cards for income, expenses, sales, purchases, net profit, outstanding supplier loans, and pending advance payments with loading states.",
  "frontend/src/components/ExpenseForm.tsx": "Form component for adding expense records with amount, category selection from predefined options, and optional description fields.",
  "frontend/src/components/ExpenseList.tsx": "Displays a sortable table of expense records showing date, amount, category, and description with loading and empty states.",
  "frontend/src/components/ExpensePage.tsx": "Page component that combines ExpenseForm and ExpenseList to provide a complete interface for tracking daily expenses.",
  "frontend/src/components/IncomeForm.tsx": "Form component for adding income records with amount, category selection from predefined options, and optional description fields.",
  "frontend/src/components/IncomeList.tsx": "Displays a sortable table of income records showing date, amount, category, and description with loading and empty states.",
  "frontend/src/components/IncomePage.tsx": "Page component that combines IncomeForm and IncomeList to provide a complete interface for tracking daily income.",
  "frontend/src/components/PurchaseForm.tsx": "Form component for adding purchase records with fields for item name, supplier, quantity, unit cost, and auto-calculated total cost. Validates inputs and submits via useAddPurchaseRecord mutation hook.",
  "frontend/src/components/PurchaseList.tsx": "Displays a table of purchase records sorted by date (newest first) with columns for date, item name, quantity, unit cost, total cost, and supplier. Shows loading and empty states.",
  "frontend/src/components/PurchasePage.tsx": "Container page component that renders the PurchaseForm and PurchaseList components with a header section.",
  "frontend/src/components/SalesForm.tsx": "Form component for adding sales transactions with fields for item name, customer, quantity, unit price, and auto-calculated total amount. Validates inputs and submits via useAddSalesTransaction mutation hook.",
  "frontend/src/components/SalesList.tsx": "Displays a table of sales transactions sorted by date (newest first) with columns for date, item name, quantity, unit price, total amount, and customer. Shows loading and empty states.",
  "frontend/src/components/SalesPage.tsx": "Container page component that renders the SalesForm and SalesList components with a header section.",
  "frontend/src/components/SupplierLoanForm.tsx": "Form component for recording supplier loans with fields for amount, supplier name, and purpose. Submits via useAddSupplierLoan mutation hook.",
  "frontend/src/components/SupplierLoanList.tsx": "Displays a table of supplier loans sorted by date with columns for date, amount, supplier, purpose, status badge (repaid/outstanding), and a 'Mark Repaid' action button. Handles loan repayment via useRepaySupplierLoan mutation.",
  "frontend/src/components/SupplierLoanPage.tsx": "Container page component that renders the SupplierLoanForm and SupplierLoanList components with a header section.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializes access control with an admin token from URL params, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence via AuthClient, and delegation validation with configurable idle handling.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for fetching and mutating backend data including daily records, sales transactions, purchases, supplier loans, and advance payments, with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earth-toned color palette for light and dark modes, including theme colors for UI components and charts using OKLCH color space.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging (cn), currency formatting, date formatting from bigint nanosecond timestamps, and checking if a timestamp represents today's date.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and methods to clear sensitive parameters from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors using OKLCH color space, container settings, border radius variables, custom fonts, shadows, and accordion animations.",
  "project_state.json": "Project state file for Rida Shop Manager tracking existing features for supplier loans and advance payments with navigation tabs and dashboard statistics. Contains schema metadata, feature definitions with requirement IDs, and two pending feature requests for personal borrowing and advance payment tracking."
}