{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add supplier personal borrowing and advance payment tracking",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a new 'Supplier Loans' section to track money borrowed by the supplier for personal use, including fields for amount, date, supplier name, purpose/description, and repayment status",
      "acceptanceCriteria": [
        "Users can record new supplier personal borrowing transactions with amount, date, and description",
        "Supplier loan records are stored and retrieved per authenticated user",
        "A list view displays all supplier personal borrowing records with key details",
        "Records indicate whether the loan has been repaid or is still outstanding"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SupplierLoanForm.tsx",
          "operation": "create",
          "description": "Create a form component for adding supplier loan records with fields for amount, supplier name, and purpose. Follow the existing pattern from ExpenseForm.tsx and PurchaseForm.tsx. Validate inputs and use the useAddSupplierLoan mutation hook to submit data with toast notifications. Use the authorization component to ensure only authenticated users can add loans."
        },
        {
          "path": "frontend/src/components/SupplierLoanList.tsx",
          "operation": "create",
          "description": "Create a list component displaying supplier loan records in a sortable table showing date, amount, supplier name, purpose, and repayment status. Follow the existing pattern from ExpenseList.tsx and PurchaseList.tsx. Include a repayment action button for outstanding loans that calls useRepaySupplierLoan mutation. Handle loading and empty states with appropriate messages."
        },
        {
          "path": "frontend/src/components/SupplierLoanPage.tsx",
          "operation": "create",
          "description": "Create a page container component that combines SupplierLoanForm and SupplierLoanList with a header section. Follow the existing pattern from ExpensePage.tsx and PurchasePage.tsx. Ensure the page is only accessible to authenticated users by checking authentication state."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for supplier loans: useGetSupplierLoans query hook to fetch supplier loan records, useAddSupplierLoan mutation hook to add new loans, and useRepaySupplierLoan mutation hook to mark loans as repaid. Follow the existing patterns for queries and mutations in this file, ensuring all queries depend on actor initialization and mutations invalidate relevant queries on success."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a new 'Advance Payments' section to track advance payments given to the supplier, including fields for amount, date, supplier name, purpose/description, and settlement status",
      "acceptanceCriteria": [
        "Users can record new advance payment transactions with amount, date, and description",
        "Advance payment records are stored and retrieved per authenticated user",
        "A list view displays all advance payment records with key details",
        "Records indicate whether the advance has been settled or is still pending"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdvancePaymentForm.tsx",
          "operation": "create",
          "description": "Create a form component for adding advance payment records with fields for amount, supplier name, and purpose. Follow the existing pattern from ExpenseForm.tsx and PurchaseForm.tsx. Validate inputs and use the useAddAdvancePayment mutation hook to submit data with toast notifications. Use the authorization component to ensure only authenticated users can add advance payments."
        },
        {
          "path": "frontend/src/components/AdvancePaymentList.tsx",
          "operation": "create",
          "description": "Create a list component displaying advance payment records in a sortable table showing date, amount, supplier name, purpose, and settlement status. Follow the existing pattern from ExpenseList.tsx and PurchaseList.tsx. Include a settlement action button for pending payments that calls useSettleAdvancePayment mutation. Handle loading and empty states with appropriate messages."
        },
        {
          "path": "frontend/src/components/AdvancePaymentPage.tsx",
          "operation": "create",
          "description": "Create a page container component that combines AdvancePaymentForm and AdvancePaymentList with a header section. Follow the existing pattern from ExpensePage.tsx and PurchasePage.tsx. Ensure the page is only accessible to authenticated users by checking authentication state."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for advance payments: useGetAdvancePayments query hook to fetch advance payment records, useAddAdvancePayment mutation hook to add new payments, and useSettleAdvancePayment mutation hook to mark payments as settled. Follow the existing patterns for queries and mutations in this file, ensuring all queries depend on actor initialization and mutations invalidate relevant queries on success."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add navigation tabs for 'Supplier Loans' and 'Advance Payments' to the main application navigation alongside existing Income, Expenses, Sales, and Purchases tabs",
      "acceptanceCriteria": [
        "Two new tabs appear in the main navigation: 'Supplier Loans' and 'Advance Payments'",
        "Clicking each tab navigates to the respective page with form and list views",
        "Navigation styling remains consistent with existing tabs"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add two new tabs to the navigation: 'Supplier Loans' and 'Advance Payments'. Wire these tabs to render the SupplierLoanPage and AdvancePaymentPage components respectively when selected. Follow the existing pattern for tab navigation with Dashboard, Income, Expenses, Sales, and Purchases tabs. Maintain consistent styling with the existing warm earth-tone color palette defined in the CSS variables."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update the Dashboard to include summary statistics for total outstanding supplier loans and total pending advance payments",
      "acceptanceCriteria": [
        "Dashboard displays total amount of outstanding supplier personal loans",
        "Dashboard displays total amount of pending advance payments",
        "Statistics update in real-time when new records are added",
        "Summary cards maintain consistent styling with existing dashboard metrics"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Dashboard.tsx",
          "operation": "modify",
          "description": "Add two new summary statistics cards for total outstanding supplier loans and total pending advance payments. Use useGetSupplierLoans and useGetAdvancePayments hooks to fetch data, then calculate totals by filtering for unpaid loans (repaid: false) and unsettled payments (settled: false). Display formatted currency amounts using the existing utils.ts formatCurrency function. Maintain consistent card styling with existing dashboard metrics showing income, expenses, sales, purchases, and net profit."
        }
      ]
    }
  ]
}